Repository: the78mole/bthomev2
Catalog: docs/locale/*/LC_MESSAGES/index.po
Languages: de

source: Getting Started
de: Erste Schritte

source: Library Documentation
de: Library-Dokumentation

source: Testing Tool
de: Test-Tool

source: Development
de: Entwicklung

source: Additional Information
de: Zusätzliche Informationen

source: BThomeV2 - BLE Sensor Library & Testing Tool
de: BThomeV2 - BLE Sensor Library & Test-Tool

source: License: MIT
de: Lizenz: MIT

source: Documentation Status
de: Dokumentationsstatus

source: **BThomeV2** is a comprehensive solution for developing BLE sensors following the `BThome V2 <https://bthome.io/>`_ standard. The project consists of two tightly integrated components:
de: **BThomeV2** ist eine umfassende Lösung für die Entwicklung von BLE-Sensoren nach dem `BThome V2 <https://bthome.io/>`_ Standard. Das Projekt besteht aus zwei eng integrierten Komponenten:

source: **BThomeV2 Arduino Library** - PlatformIO/Arduino library for ESP32 and nRF52
de: **BThomeV2 Arduino Library** - PlatformIO/Arduino Library für ESP32 und nRF52

source: **bthome-logger** - Python-based testing and monitoring tool
de: **bthome-logger** - Python-basiertes Test- und Monitoring-Tool

source: **nRF52 Implementation Currently Broken**
de: **nRF52-Implementierung derzeit defekt**

source: The nRF52 platform is currently non-functional due to runtime issues with Bluefruit initialization. ESP32 works fully.
de: Die nRF52-Plattform ist derzeit aufgrund von Laufzeitproblemen mit der Bluefruit-Initialisierung nicht funktionsfähig. ESP32 funktioniert vollständig.

source: **Status:** ✅ ESP32 fully functional | ❌ nRF52 broken (runtime hang)
de: **Status:** ✅ ESP32 voll funktionsfähig | ❌ nRF52 defekt (Laufzeit-Hänger)

source: Overview
de: Übersicht

source: The BThomeV2 library provides a unified interface for BLE advertising using the BThome V2 format, designed for efficient transmission of sensor data over Bluetooth Low Energy. The library abstracts platform-specific BLE implementations, making it easy to develop BThome V2-compatible devices on different hardware platforms.
de: Die BThomeV2-Library bietet eine einheitliche Schnittstelle für BLE-Advertising im BThome V2 Format, entwickelt für die effiziente Übertragung von Sensordaten über Bluetooth Low Energy. Die Library abstrahiert plattformspezifische BLE-Implementierungen und macht es einfach, BThome V2-kompatible Geräte auf verschiedenen Hardware-Plattformen zu entwickeln.

source: The **bthome-logger** tool complements the library perfectly by decoding received BLE advertisements and displaying them in human-readable format. Both components are versioned synchronously to ensure compatibility.
de: Das **bthome-logger** Tool ergänzt die Library perfekt, indem es empfangene BLE-Advertisements dekodiert und in einem für Menschen lesbaren Format anzeigt. Beide Komponenten werden synchron versioniert, um Kompatibilität sicherzustellen.

source: Main Features
de: Hauptfunktionen

source: ✅ BThome V2 protocol support
de: ✅ BThome V2 Protokoll-Unterstützung

source: ✅ Multiple sensor types (temperature, humidity, pressure, CO2, etc.)
de: ✅ Mehrere Sensortypen (Temperatur, Luftfeuchtigkeit, Druck, CO2, etc.)

source: ✅ Binary sensor support (motion, door, window, etc.)
de: ✅ Binärsensor-Unterstützung (Bewegung, Tür, Fenster, etc.)

source: ✅ Event support (button actions)
de: ✅ Event-Unterstützung (Button-Aktionen)

source: ✅ Platform abstraction (ESP32 and nRF52)
de: ✅ Plattform-Abstraktion (ESP32 und nRF52)

source: ✅ Easy-to-use API
de: ✅ Einfach zu verwendende API

source: ✅ Encryption support (framework in place)
de: ✅ Verschlüsselungs-Unterstützung (Framework vorhanden)

source: ✅ Low-power BLE advertising
de: ✅ Stromsparendes BLE-Advertising

source: Python Testing Tool
de: Python Test-Tool

source: ✅ BLE advertisement monitoring
de: ✅ BLE-Advertisement-Überwachung

source: ✅ BThome V2 decoding
de: ✅ BThome V2 Dekodierung

source: ✅ Device filtering
de: ✅ Geräte-Filterung

source: ✅ RSSI display
de: ✅ RSSI-Anzeige

source: ✅ Human-readable output
de: ✅ Menschenlesbare Ausgabe

source: ✅ Live monitoring
de: ✅ Live-Überwachung

source: Supported Platforms
de: Unterstützte Plattformen

source: **ESP32** ✅ - Uses ArduinoBLE library (fully tested and functional)
de: **ESP32** ✅ - Verwendet ArduinoBLE Library (vollständig getestet und funktionsfähig)

source: **nRF52** ❌ - Uses Adafruit Bluefruit library (currently broken - runtime hang)
de: **nRF52** ❌ - Verwendet Adafruit Bluefruit Library (derzeit defekt - Laufzeit-Hänger)

source: Quick Start
de: Schnellstart

source: **Testing Tool Installation:**
de: **Test-Tool Installation:**
